Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་རྩི་སྨན་སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་མེད་པའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Oṣadhi will be born in a place called Light of Freedom from Suffering.

source: ཡབ་ནི་མིག་སྡུག་ཅེས་བྱའོ། །
en: Beautiful Eye will be his father.

source: ཡུམ་ནི་གློག་བྱིན་མ་ཞེས་བྱའོ། །
en: Giver of Lightning will be his mother.

source: སྲས་ནི་བློའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of the Mind will be his son.

source: རིམ་གྲོ་པ་ནི་དཔལ་གྱི་བཟང་མཆོག་ཅེས་བྱའོ། །
en: Glorious Supreme Excellence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐམས་ཅད་མཐོང་ཞེས་བྱའོ། །
en: Seeing Everything will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དགུ་དགུའོ། །
en: There will be sixty consecutive congregations, each of them gathering nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གྲོལ་བའི་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: “The thus-gone Vimuktaketu will be born in a place called Crest Banner.

source: ཡུམ་ནི་ཏོག་ཆེན་མ་ཞེས་བྱའོ། །
en: Great Crest will be his mother.

source: སྲས་ནི་གྲགས་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Famed Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་ཕྱོགས་གྲགས་ཞེས་བྱའོ། །
en: Fame throughout the Directions will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Lion Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྲུག་སྒྲ་ང་རོ་ཞེས་བྱའོ། །
en: Roaring Thunder will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be eighteen consecutive congregations, each of them gathering one trillion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-five thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བདུན་ཁྲི་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for seventy-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཀྱི་མཛོད་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་སྦེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Prabhākośa will be born in a place called Hidden Jewels.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དྲུག་ཙམ་མོ། །
en: His light will extend as far as six worlds of four continents.

source: ཡུམ་ནི་དད་མཆོག་ཅེས་བྱའོ། །
en: Supreme Faith will be his mother.

source: སྲས་ནི་གསལ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Luminosity will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Crest Banner will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ནོར་ལྷའི་བུ་ཏོག་ཅེས་བྱའོ། །
en: Crest of the Child of the Wealth God will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be thirty consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Jñānarāja will be born in a place called Supreme Splendor.

source: ཡབ་ནི་སྣང་བ་ཅན་ཞེས་བྱའོ། །
en: Endowed with Light will be his father.

source: སྲས་ནི་མཚན་གྱིས་རབ་ཏུ་བརྒྱན་པ་ཞེས་བྱའོ། །
en: Adorned with Marks will be his son.

source: རིམ་གྲོ་པ་ནི་བལྟ་ན་སྡུག་པ་ཞེས་བྱའོ། །
en: Delightful to Behold will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྟ་བའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of the View will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྣང་བའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be thirty consecutive congregations, each of them gathering seven hundred million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དགུ་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for ninety-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་འཇིགས་མཛད་སྐྱེ་བའི་ཡུལ་ནི་འཇིགས་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Bhīṣaṇa will be born in a place called Supremely Terrifying.

source: ཡབ་ནི་དབང་ཕྱུག་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Lord will be his father.

source: ཡུམ་ནི་དགེ་བ་ཅན་ཞེས་བྱའོ། །
en: Virtuous will be his mother.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་ཟད་པའི་བློ་ཞེས་བྱའོ། །
en: Inexhaustible Intellect will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྟ་བས་མཐོང་ཞེས་བྱའོ། །
en: Vision through the View will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ཆུ་བོ་སྤོང་བ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་གསལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Oghajaha will be born in a place called Luminous Array.

source: ཡབ་ནི་དཔའ་བའི་འོད་ཅེས་བྱའོ། །
en: Light of Heroes will be his father.

source: ཡུམ་ནི་འདམ་ལས་རྒལ་ཞེས་བྱའོ། །
en: Free from the Swamp will be his mother.

source: སྲས་ནི་ཡུལ་འཁོར་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Leader of the Land will be his son.

source: རིམ་གྲོ་པ་ནི་བལྟ་བཟོད་ཅེས་བྱའོ། །
en: Accepting the View will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ཅན་ཞེས་བྱའོ། །
en: Action without Unwholesomeness will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྐང་མི་འཁྱོལ་ཞེས་བྱའོ། །
en: Not Traveling by Foot will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་དྲུག་ཅུ་དྲུག་ཅུའོ། །
en: There will be six consecutive congregations, each of them gathering sixty billion.

source: མཆོད་རྟེན་ཡང་གཅིག་ཏུ་ཟད་དོ།། །།
en: There will also only be one stūpa.

source: དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་ཕྱོགས་གསལ་ཞེས་བྱའོ། །
en: “The thus-gone Asaṅgakīrti will be born in a place called Luminous Directions.

source: ཡབ་ནི་དབང་ཆེན་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Great Lord will be his father.

source: སྲས་ནི་སེམས་གསལ་ཞེས་བྱའོ། །
en: Luminous Mind will be his son.

source: རིམ་གྲོ་པ་ནི་སྐར་མའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Star Radiance will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་དུལ་བ་ཞེས་བྱའོ། །
en: Perfectly Trained will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རབ་ཏུ་ཞི་བའི་འགྲོས་ཞེས་བྱའོ། །
en: Mode of Great Serenity will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ལྔ་འབུམ་ལྔ་འབུམ་མོ། །
en: There will be thirteen consecutive congregations of worthy ones, each of them gathering five hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པའི་ཕུང་པོ་སྐྱེ་བའི་ཡུལ་ནི་བདེན་པའི་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Satyarāśi will be born in a place called Crest of Truth.

source: ཡབ་ནི་དྲི་མ་མེད་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Stainless Fame will be his father.

source: ཡུམ་ནི་ཆོས་མཐོང་མ་ཞེས་བྱའོ། །
en: Seeing the Dharma will be his mother.

source: རིམ་གྲོ་པ་ནི་ཆོས་དབྱངས་ཞེས་བྱའོ། །
en: Dharma Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུལ་མེད་སེམས་ཞེས་བྱའོ། །
en: Mind Free from Delusion will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཉམ་པ་དང་མི་མཉམ་པ་ལྟ་བ་ཞེས་བྱའོ། །
en: Extraordinary Sight will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ལྔ་འབུམ་ལྔ་འབུམ་མོ། །
en: There will be fifty consecutive congregations of worthy ones, each of them gathering five hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་ཡུལ་བཟངས་ཞེས་བྱའོ། །
en: “The thus-gone Susvara will be born in a place called Land of Excellence.

source: ཡབ་ནི་མཐུ་རྩལ་སྤྱོད་ཅེས་བྱའོ། །
en: Powerful Action will be his father.

source: སྲས་ནི་སྟོན་དགའ་ཞེས་བྱའོ། །
en: Joyous Teacher will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཏོག་ཆེན་ཞེས་བྱའོ། །
en: Great Crest will be foremost in terms of insight.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་དུང་ཕྱུར་རོ། །
en: There will be seventy consecutive congregations of worthy ones, each of them gathering one hundred million.

source: དེ་བཞིན་གཤེགས་པ་རི་དབང་མཚུངས་སྐྱེ་བའི་ཡུལ་ནི་སྣ་ཚོགས་རྗེས་སུ་འབྲེལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Girīndrakalpa will be born in a place called Rich Connections.

source: ཡབ་ནི་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Array will be his father.

source: ཡུམ་ནི་བཀོད་པ་མཐའ་ཡས་མ་ཞེས་བྱའོ། །
en: Infinite Array will be his mother.

source: རིམ་གྲོ་པ་ནི་ཐོས་པ་བསྩགས་ཞེས་བྱའོ། །
en: Accumulated Learning will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་བསྩགས་ཞེས་བྱའོ། །
en: Accumulated Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ནོར་སྦྱིན་གསལ་ཞེས་བྱའོ། །
en: Clear Gift of Wealth will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བརྒྱད་ཅུའོ། །
en: There will be eighty consecutive congregations of worthy ones.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་བརྩེགས་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་སྣ་ཚོགས་བཟང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Dharmakūṭa will be born in a place called Rich Array of Excellence.

source: ཡབ་ནི་སྤོབས་པ་མཛེས་ཞེས་བྱའོ། །
en: Beautiful Acumen will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་བཀོད་པ་ཞེས་བྱའོ། །
en: Splendid Array will be his mother.

source: སྲས་ནི་ལྟ་བ་གསལ་ཞེས་བྱའོ། །
en: Clear View will be his son.

source: རིམ་གྲོ་པ་ནི་སྐར་མདའ་འཆང་ཞེས་བྱའོ། །
en: Holder of Shooting Stars will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་པའི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Power of Truth will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be thirty-two consecutive congregations of worthy ones, each of them gathering three hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-eight thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་སུམ་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for thirty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཐར་པའི་གཟི་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བྱིན་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mokṣatejas will be born in a place called Splendid Array.

source: ཡབ་ནི་གཟི་བྱིན་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Splendor be his father.

source: སྲས་ནི་དགེ་བར་སེམས་ཞེས་བྱའོ། །
en: Attentive to Virtue will be his son.

source: རིམ་གྲོ་པ་ནི་འཕགས་འདུལ་ཞེས་བྱའོ། །
en: Noble Discipline will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་གྲགས་ཞེས་བྱའོ། །
en: Dharma Fame will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་དྲི་མེད་ཅེས་བྱའོ། །
en: Stainless Power will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་ལྔ་བཅུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be fifty-nine consecutive congregations of worthy ones, each of them gathering one trillion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་མཛད་སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་དང་བྲལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Śobhita will be born in a place called Free from Suffering.

source: ཡབ་ནི་ལེགས་མཐོང་ཞེས་བྱའོ། །
en: Excellent Sight will be his father.

source: ཡུམ་ནི་ཀུན་མཐོང་མ་ཞེས་བྱའོ། །
en: All-Seeing will be his mother.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་རྡོ་རྗེ་ཞེས་བྱའོ། །
en: Vajra Power will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be six consecutive congregations of worthy ones, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞི་བའི་སྐུ་སྐྱེ་བའི་ཡུལ་ནི་རབ་ཏུ་ཞི་དུལ་ཞེས་བྱའོ། །
en: “The thus-gone Praśāntagātra will be born in a place called Pacified and Tamed.

source: ཡབ་ནི་གླང་པོའི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Powerful Elephant will be his father.

source: ཡུམ་ནི་བསོད་ནམས་འོད་ཅེས་བྱའོ། །
en: Light of Merit will be his mother.

source: སྲས་ནི་དུལ་གནས་དགའ་ཞེས་བྱའོ། །
en: Joy in Abiding by the Training will be his son.

source: རིམ་གྲོ་པ་ནི་གནས་དག་ཅེས་བྱའོ། །
en: Pure Abode will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ། །
en: Perfectly Pure Discipline will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤྱོད་པ་མི་གནས་པ་ཞེས་བྱའོ། །
en: Unsupported Conduct will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་ལྔ་ལྔའོ། །
en: There will be eleven consecutive congregations of worthy ones, each of them gathering five hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཡིད་དུ་འོང་བའི་གསུང་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཡིད་དུ་འཐད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Manojñavākya will be born in a place called Compelling Array.

source: ཡབ་ནི་སེང་གེའི་ང་རོ་ཞེས་བྱའོ། །
en: Lion’s Roar will be his father.

source: ཡུམ་ནི་ཆགས་མེད་བློ་ཞེས་བྱའོ། །
en: Mind of Detachment will be his mother.

source: སྲས་ནི་འཇིགས་པ་མེད་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Fearless Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་གྱ་ནོམ་ང་རོ་ཞེས་བྱའོ། །
en: Sublime Roar will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་དབང་པོ་ཞེས་བྱའོ། །
en: Powerful Ruler will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་ཀྱི་འཁོར་ལོ་ཞེས་བྱའོ། །
en: Wheel of Strengths will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་ལྔ་ལྔའོ། །
en: There will be thirty-two consecutive congregations, each of them gathering five hundred million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་སུམ་ཁྲི་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for thirty-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་བློ་སྦྱངས་སྐྱེ་བའི་ཡུལ་ནི་འགྲོས་སྟབས་བཟང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Cīrṇabuddhi will be born in a place called Excellent Gait.

source: ཡབ་ནི་སེང་གེའི་ལོགས་ཞེས་བྱའོ། །
en: Lion Flank will be his father.

source: ཡུམ་ནི་སེང་གེའི་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Lion Intelligence will be his mother.

source: སྲས་ནི་འབྲུག་སྒྲའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Royal Thunder will be his son.

source: རིམ་གྲོ་པ་ནི་སེང་གེའི་ང་རོ་ཞེས་བྱའོ། །
en: Lion’s Roar will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་པ་མེད་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Unobscured Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤྱོད་པ་ཅན་ཞེས་བྱའོ། །
en: Possessor of Action will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་བརྒྱད་དོ། །
en: There will be seventy consecutive congregations of worthy ones, each of them gathering six million eight hundred thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་ཁྲི་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixty-nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཆུ་ལྷ་སྐྱེ་བའི་ཡུལ་ནི་ཀླུ་དབྱངས་ཞེས་བྱའོ། །
en: “The thus-gone Varuṇa will be born in a place called Nāga Melody.

source: ཡབ་ནི་ཀླུ་དབྱངས་ང་རོ་ཞེས་བྱའོ། །
en: Roaring Nāga Melody will be his father.

source: ཡུམ་ནི་ཀླུ་དཔལ་ཞེས་བྱའོ། །
en: Nāga Glory will be his mother.

source: སྲས་ནི་ཀླུ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Nāga will be his son.

source: རིམ་གྲོ་པ་ནི་འགྲོ་གཙོ་ཞེས་བྱའོ། །
en: Foremost Being will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤོབས་པ་སེམས་ཞེས་བྱའོ། །
en: Mind of Acumen will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་རྩ་དྲུག་གོ། །
en: There will be seventy consecutive congregations, each of them gathering three hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་འགྲོ་བས་མཆོད་སྐྱེ་བའི་ཡུལ་ནི་སཱ་ལའི་དབང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Jagatpūjita will be born in a place called Śāla Ruler.

source: ཡབ་ནི་དབང་པོའི་ང་རོ་སྒྲོགས་ཞེས་བྱའོ། །
en: Accompanied by the Ruler’s Roar will be his father.

source: ཡུམ་ནི་སྟོན་པ་མཐའ་ཡས་མ་ཞེས་བྱའོ། །
en: Infinite Teacher will be his mother.

source: སྲས་ནི་དབང་པོའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Ruler Radiance will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་རིན་པོ་ཆེའི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Power of Precious Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་སྨོན་ལམ་སེམས་ཞེས་བྱའོ། །
en: Mind of Insight and Aspiration will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be thirty-eight consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ལོགས་སྐྱེ་བའི་ཡུལ་ནི་གསེར་གྱི་ལོགས་ཞེས་བྱའོ། །
en: “The thus-gone Siṃhapārśva will be born in a place called Golden Flank.

source: ཡབ་ནི་རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Jewel Banner will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་རིན་ཆེན་ཞེས་བྱའོ། །
en: Precious Splendor will be his mother.

source: སྲས་ནི་རིན་ཆེན་སྦེད་ཅེས་བྱའོ། །
en: Hidden Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་མཛེས་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Beauty will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་འོད་ཅེས་བྱའོ། །
en: Luminous Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པ་མ་འདྲེས་པ་ཞེས་བྱའོ། །
en: Distinct Fame will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་མཐུ་རྩལ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: “The thus-gone Dharmavikrāmin will be born in a place called Qualities of Power.

source: ཡབ་ནི་མཐུ་རྩལ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Power will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Wisdom Power will be his mother.

source: སྲས་ནི་རིན་ཆེན་འཕགས་ཞེས་བྱའོ། །
en: Superior Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་སེམས་གསལ་ཞེས་བྱའོ། །
en: Clear Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྲུག་སྒྲ་སྒྲོགས་པ་ཞེས་བྱའོ། །
en: Roaring Thunder will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be sixty-six consecutive congregations, each of them gathering three million.

source: དེ་བཞིན་གཤེགས་པ་བསྐལ་པ་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་སྡུག་པ་ཞེས་བྱའོ། །
en: “The thus-gone Subhaga will be born in a place called Attractive Array.

source: ཡབ་ནི་རྣམ་སྨིན་སྡུག་ཅེས་བྱའོ། །
en: Attractive Ripening will be his father.

source: སྲས་ནི་ལྷ་འདོད་ཅེས་བྱའོ། །
en: Divine Wish will be his son.

source: རིམ་གྲོ་པ་ནི་འཁྲུལ་མེད་གནས་ཞེས་བྱའོ། །
en: Abiding Free from Delusion will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བས་རབ་ཏུ་བརྒྱན་པའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiance Adorned with the Moon will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be fourteen consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་མདོག་སྐྱེ་བའི་ཡུལ་ནི་འོད་དཔལ་མཐོ་རིས་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Akṣobhyavarṇa will be born in a place called Supreme Heaven of Glorious Light.

source: ཡབ་ནི་གསེར་བཟངས་ངེས་འོད་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Splendid Light of Excellent Gold will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་མཐའ་ཡས་བཀོད་པ་ཞེས་བྱའོ། །
en: Array of Infinite Qualities will be his mother.

source: སྲས་ནི་ཟླ་བས་རབ་ཏུ་བརྒྱན་པའི་གཟི་བརྗིད་འོད་ཟེར་དབྱངས་ཞེས་བྱའོ། །
en: Melody of the Splendid Radiance Adorned with the Moon will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་སྟོབས་བྱེད་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Array of Empowering Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གྱི་རྒྱ་མཚོའི་བློ་ཅན་ངེས་པར་སྟོན་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence of the Revealer of the Mind of the Ocean of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐྱོན་གྱིས་ཟིལ་གྱིས་མི་ནོན་ཞིང་བདུད་ཀྱི་དཔུང་རབ་ཏུ་ཕུང་བར་བྱེད་པའི་གཟི་བརྗིད་ཀྱི་ཁ་དོག་ཅེས་བྱའོ། །
en: Colors of the Splendor That Cannot Become Flawed Yet Defeats the Hordes of the Māras will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་འབུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་འབུམ་ཕྲག་བརྒྱད་ཅུ་བརྒྱད་ཅུའོ། །
en: There will be one hundred thousand consecutive congregations, each of them gathering eighty trillion irreversible bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་རིན་པོ་ཆེ་བརྒྱ་སྟོང་གི་ཡན་ལག་གི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Tejorāja will be born in a place called King of the Hundred Thousandfold Factors of Precious Qualities.

source: འོད་ནི་དཔག་ཚད་ས་ཡ་ཕྲག་གསུམ་མོ། །
en: His light will extend three million leagues.

source: ཡབ་ནི་གཟི་བརྗིད་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Light of Infinite Qualities will be his father.

source: ཡུམ་ནི་རིགས་པའི་གཟི་བྱིན་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiance of Splendid Reasoning will be his mother.

source: སྲས་ནི་ཟླ་བ་དྲི་མ་མེད་པའི་ཏོག་དཔལ་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Glorious Banner of the Stainless Moon Crest will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་འོད་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Light of Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཀོད་པ་དཔག་ཏུ་མེད་པ་སྒྲུབ་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Mind That Accomplishes the Unfathomable Array will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་ཀྱི་གཟི་བརྗིད་སངས་རྒྱས་ལས་ཡང་དག་པར་བྱུང་བ་ཞེས་བྱའོ། །
en: Authentic Emergence from the Luminous Splendor of Buddhahood will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དགུ་དགུའོ། །
en: There will be ten consecutive congregations, each of them gathering nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་རྟོགས་མཛད་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་གསལ་ཞེས་བྱའོ། །
en: “The thus-gone Bodhana will be born in a place called Radiant Splendor.

source: ཡབ་ནི་ཤིན་ཏུ་རྣམ་པར་དག་པའི་བློ་ཞེས་བྱའོ། །
en: Utterly Pure Mind will be his father.

source: ཡུམ་ནི་བློ་གསལ་ལྡན་ཞེས་བྱའོ། །
en: Endowed with Clear Mind will be his mother.

source: སྲས་ནི་ཡོན་ཏན་ཐམས་ཅད་རྟོགས་བྱེད་ཡེ་ཤེས་བྱིན་ཞེས་བྱའོ། །
en: Wisdom Gift That Comprehends All Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་ཡིད་འོང་སེམས་པ་འདོད་ཅེས་བྱའོ། །
en: Wish for Delightful Attention will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་ཀྱི་འབྱུང་གནས་བྱང་ཆུབ་ཏུ་སྨོན་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Source of Insight Possessing the Mind Aspiring to Awakening will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་པོ་ཆེའི་མེ་ཏོག་གི་འོད་ཅེས་བྱའོ། །
en: Light of Jewel Flowers will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be eighteen consecutive congregations, each of them gathering eight billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བཞི་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be forty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་ལེགས་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་འབུམ་ཕྲག་བཀོད་པར་སྣང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Sulocana will be born in a place called Displaying an Array of a Hundred Thousand Qualities.

source: འོད་ནི་དཔག་ཚད་སུམ་ཁྲི་བཞི་སྟོང་ངོ་། །
en: His light will extend thirty-four thousand leagues.

source: ཡབ་ནི་སྤྱོད་པ་མ་འཁྲུལ་གསལ་བའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Clear and Unmistaken Conduct will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་ཕུང་པོ་གཟི་བརྗིད་འཕགས་ལྡན་མ་ཞེས་བྱའོ། །
en: Possessing the Superior Splendor of the Aggregate of Wisdom will be his mother.

source: སྲས་ནི་སྒྲ་སྐད་ཟད་མི་ཤེས་པར་སྟོན་པའི་བློ་གྲོས་ཅན་ཞེས་བྱའོ། །
en: Intelligence That Reveals Inexhaustible Language will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེས་རབ་ཀྱི་སྣང་བ་རྣམ་པར་གདོན་མི་ཟ་བའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཞེས་བྱའོ། །
en: Blooming Flower That Does Not Doubt the Light of Insight will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་བྱེ་བ་བརྒྱ་ཕྲག་སྙེད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པའི་ཉི་མའི་གཟི་བརྗིད་ཀྱི་ཁ་དོག་ཅན་ཞེས་བྱའོ། །
en: Possessing the Colors of the Splendid Sun That Remains Unaffected in the Face of Billions of Māras will be foremost in terms of insight.
